# TilePatternGridCellsX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TilePatternGridCellsX Property
ParameterTypeId Class See Also
---
"Number of horizontal cells"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TilePatternGridCellsX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TilePatternGridCellsX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TilePatternGridCellsX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace